export interface Property {
  id: number;
  name: string;
  location: string;
  image: string;
  units: string;
  size: string;
  status: string;
  price: string;
  description: string[];
  features: string[];
  gallery: string[];
  plans: string[];
  specs: {
    bedrooms: string;
    bathrooms: string;
    parking: string;
    year: string;
  };
}
export const properties: Property[] = [
  {
    id: 1,
    name: "ЖК Байар",
    location: "Центр города",
    image: "/images/Байар/1.jpg",
    units: "124 квартиры",
    size: "38-102 м²",
    status: "В продаже",
    price: "от 3 000 000 ₽",
    description: [
      "Мы рады представить вам жилой комплекс, который сочетает престижное расположение и безупречное качество жизни.",
      "Расположенный напротив администрации города Магас, ЖК «Байар» предлагает уникальную возможность стать частью нового центра городской жизни.",
      "Выберите ЖК «Байар» и насладитесь жизнью в современном доме с развитой инфраструктурой и уровнем комфорта, который вы заслуживаете.",
      "Наши квартиры созданы для тех, кто ценит уют и стремится к совершенству.",
      "Поторопитесь! Количество квартир ограничено. Зайдите на наш сайт и подберите свой идеальный дом в сердце Магаса сегодня.",
      "ЖК «Байар» — это жизнь, которая впечатляет! Не упустите свой шанс начать новую, яркую главу в вашей жизни!"
    ],
    features: [
      "Консьерж-сервис 24/7",
      "Фитнес-центр",
      "Детская площадка",
      "Охраняемая территория",
      "Собственный парк",
      "Панорамные окна",
    ],
    gallery: [
      "/images/Байар/1.jpg",
      "/images/Байар/2.jpeg",
      "/images/Байар/3.jpeg",
      "/images/Байар/4.jpeg",
      "/images/Байар/5.jpeg",
      "/images/Байар/6.jpeg",
      "/images/Байар/7.jpeg",
      "/images/Байар/8.jpeg",
    ],
    plans: [
      "/images/Байар/схемы/1-1.jpg",
      "/images/Байар/схемы/1-2.jpg",
      "/images/Байар/схемы/1-3.jpg",
      "/images/Байар/схемы/1-4.jpg",
    ],
    specs: {
      bedrooms: "2-4",
      bathrooms: "2-3",
      parking: "1-2",
      year: "2024",
    },
  },
  {
    id: 2,
    name: "ЖК Г1алмурз",
    location: "Финансовый район",
    image: "/images/Г1алмурз/1.jpg",
    units: "86 квартир",
    size: "88-297 м²",
    status: "Предзаказ",
    price: "от 25 800 000 ₽",
    description: [
      "Мы рады представить вам жилой комплекс, который сочетает престижное расположение и безупречное качество жизни.",
      "Расположенный напротив администрации города Магас, ЖК «Байар» предлагает уникальную возможность стать частью нового центра городской жизни.",
      "Выберите ЖК «Байар» и насладитесь жизнью в современном доме с развитой инфраструктурой и уровнем комфорта, который вы заслуживаете.",
      "Наши квартиры созданы для тех, кто ценит уют и стремится к совершенству.",
      "Поторопитесь! Количество квартир ограничено. Зайдите на наш сайт и подберите свой идеальный дом в сердце Магаса сегодня.",
      "ЖК «Байар» — это жизнь, которая впечатляет! Не упустите свой шанс начать новую, яркую главу в вашей жизни!"
    ],
    features: [
      "Бассейн на крыше",
      "Коворкинг",
      "Кинотеатр",
      "Премиум-отделка",
      "Лобби с двойной высотой",
    ],
    gallery: [
      "/images/Г1алмурз/1.jpg",
      "/images/Г1алмурз/2.jpeg",
      "/images/Г1алмурз/3.jpeg",
      "/images/Г1алмурз/4.jpeg",
      "/images/Г1алмурз/5.jpeg",
      "/images/Г1алмурз/6.jpeg",
      "/images/Г1алмурз/7.jpeg",
      "/images/Г1алмурз/8.jpeg",
    ],
    plans: [
      "/images/Г1алмурз/схемы/1-1.jpg",
      "/images/Г1алмурз/схемы/1-2.jpg",
      "/images/Г1алмурз/схемы/1-3.jpg",
      "/images/Г1алмурз/схемы/1-4.jpg",
      "/images/Г1алмурз/схемы/1-5.jpg",
      "/images/Г1алмурз/схемы/1-6.jpg",
      "/images/Г1алмурз/схемы/1-7.jpg",
      "/images/Г1алмурз/схемы/1-8.jpg",
    ],
    specs: {
      bedrooms: "3-5",
      bathrooms: "3-4",
      parking: "2-3",
      year: "2025",
    },
  },
  {
    id: 3,
    name: "ЖК Г1алих",
    location: "Финансовый район",
    image: "/images/Г1алих/1.jpg",
    units: "86 квартир",
    size: "88-297 м²",
    status: "Предзаказ",
    price: "от 25 800 000 ₽",
    description: [
      "Мы рады представить вам жилой комплекс, который сочетает престижное расположение и безупречное качество жизни.",
      "Расположенный напротив администрации города Магас, ЖК «Байар» предлагает уникальную возможность стать частью нового центра городской жизни.",
      "Выберите ЖК «Байар» и насладитесь жизнью в современном доме с развитой инфраструктурой и уровнем комфорта, который вы заслуживаете.",
      "Наши квартиры созданы для тех, кто ценит уют и стремится к совершенству.",
      "Поторопитесь! Количество квартир ограничено. Зайдите на наш сайт и подберите свой идеальный дом в сердце Магаса сегодня.",
      "ЖК «Байар» — это жизнь, которая впечатляет! Не упустите свой шанс начать новую, яркую главу в вашей жизни!"
    ],
    features: [
      "Бассейн на крыше",
      "Коворкинг",
      "Кинотеатр",
      "Премиум-отделка",
      "Лобби с двойной высотой",
    ],
    gallery: [
      "/images/Г1алих/1.jpg",
      "/images/Г1алих/2.jpeg",
      "/images/Г1алих/3.jpeg",
      "/images/Г1алих/4.jpeg",
      "/images/Г1алих/5.jpeg",
    ],
    plans: [
      "/images/Г1алих/схемы/1-1.jpg",
      "/images/Г1алих/схемы/1-2.jpg",
      "/images/Г1алих/схемы/1-3.jpg",
      "/images/Г1алих/схемы/1-4.jpg",
      "/images/Г1алих/схемы/1-5.jpg",
      "/images/Г1алих/схемы/1-6.jpg",
      "/images/Г1алих/схемы/1-7.jpg",
      "/images/Г1алих/схемы/1-8.jpg",
      "/images/Г1алих/схемы/1-9.jpg",
      "/images/Г1алих/схемы/1-10.jpg",
      "/images/Г1алих/схемы/1-11.jpg",
      "/images/Г1алих/схемы/1-12.jpg",
    ],
    specs: {
      bedrooms: "3-5",
      bathrooms: "3-4",
      parking: "2-3",
      year: "2025",
    },
  },
  {
    id: 4,
    name: "ЖК Муталиевский",
    location: "Финансовый район",
    image: "/images/Муталиевский/1.jpeg",
    units: "86 квартир",
    size: "88-297 м²",
    status: "Предзаказ",
    price: "от 25 800 000 ₽",
    description: [
      "Мы рады представить вам жилой комплекс, который сочетает престижное расположение и безупречное качество жизни.",
      "Расположенный напротив администрации города Магас, ЖК «Байар» предлагает уникальную возможность стать частью нового центра городской жизни.",
      "Выберите ЖК «Байар» и насладитесь жизнью в современном доме с развитой инфраструктурой и уровнем комфорта, который вы заслуживаете.",
      "Наши квартиры созданы для тех, кто ценит уют и стремится к совершенству.",
      "Поторопитесь! Количество квартир ограничено. Зайдите на наш сайт и подберите свой идеальный дом в сердце Магаса сегодня.",
      "ЖК «Байар» — это жизнь, которая впечатляет! Не упустите свой шанс начать новую, яркую главу в вашей жизни!"
    ],
    features: [
      "Бассейн на крыше",
      "Коворкинг",
      "Кинотеатр",
      "Премиум-отделка",
      "Лобби с двойной высотой",
    ],
    gallery: [
      "/images/Муталиевский/1.jpeg",
      "/images/Муталиевский/2.jpeg",
      "/images/Муталиевский/3.jpeg",
      "/images/Муталиевский/4.jpeg",
      "/images/Муталиевский/5.jpeg",
      "/images/Муталиевский/6.jpeg",
      "/images/Муталиевский/7.jpeg",
    ],
    plans: [
      "/images/Муталиевский/схемы/1-1.jpg",
      "/images/Муталиевский/схемы/1-2.jpg",
      "/images/Муталиевский/схемы/1-3.jpg",
      "/images/Муталиевский/схемы/1-4.jpg",
    ],
    specs: {
      bedrooms: "3-5",
      bathrooms: "3-4",
      parking: "2-3",
      year: "2025",
    },
  },
  {
    id: 5,
    name: "ЖК Тимур",
    location: "Финансовый район",
    image: "/images/Тимур/1.jpeg",
    units: "86 квартир",
    size: "88-297 м²",
    status: "Предзаказ",
    price: "от 25 800 000 ₽",
    description: [
      "Мы рады представить вам жилой комплекс, который сочетает престижное расположение и безупречное качество жизни.",
      "Расположенный напротив администрации города Магас, ЖК «Байар» предлагает уникальную возможность стать частью нового центра городской жизни.",
      "Выберите ЖК «Байар» и насладитесь жизнью в современном доме с развитой инфраструктурой и уровнем комфорта, который вы заслуживаете.",
      "Наши квартиры созданы для тех, кто ценит уют и стремится к совершенству.",
      "Поторопитесь! Количество квартир ограничено. Зайдите на наш сайт и подберите свой идеальный дом в сердце Магаса сегодня.",
      "ЖК «Байар» — это жизнь, которая впечатляет! Не упустите свой шанс начать новую, яркую главу в вашей жизни!"
    ],
    features: [
      "Бассейн на крыше",
      "Коворкинг",
      "Кинотеатр",
      "Премиум-отделка",
      "Лобби с двойной высотой",
    ],
    gallery: [
      "/images/Тимур/1.jpeg",
      "/images/Тимур/2.jpeg",
      "/images/Тимур/3.jpeg",
      "/images/Тимур/4.jpeg",
      "/images/Тимур/5.jpeg",
      "/images/Тимур/6.jpeg",
      "/images/Тимур/7.jpeg",
    ],
    plans: [
    ],
    specs: {
      bedrooms: "3-5",
      bathrooms: "3-4",
      parking: "2-3",
      year: "2025",
    },
  },
  {
    id: 6,
    name: "ЖК Изумруд",
    location: "Набережная",
    image: "/images/Изумруд/1.jpg",
    units: "152 квартиры",
    size: "72-195 м²",
    status: "В продаже",
    price: "от 22 300 000 ₽",
    description: [
      "Мы рады представить вам жилой комплекс, который сочетает престижное расположение и безупречное качество жизни.",
      "Расположенный напротив администрации города Магас, ЖК «Байар» предлагает уникальную возможность стать частью нового центра городской жизни.",
      "Выберите ЖК «Байар» и насладитесь жизнью в современном доме с развитой инфраструктурой и уровнем комфорта, который вы заслуживаете.",
      "Наши квартиры созданы для тех, кто ценит уют и стремится к совершенству.",
      "Поторопитесь! Количество квартир ограничено. Зайдите на наш сайт и подберите свой идеальный дом в сердце Магаса сегодня.",
      "ЖК «Байар» — это жизнь, которая впечатляет! Не упустите свой шанс начать новую, яркую главу в вашей жизни!"
    ],
    features: [
      "Собственная набережная",
      "Зелёный двор",
      "Видеонаблюдение",
      "Спортивные площадки",
    ],
    gallery: [
      "/images/Изумруд/1.jpg",
      "/images/Изумруд/2.jpg",
      "/images/Изумруд/3.jpg",
      "/images/Изумруд/4.jpg",
      "/images/Изумруд/5.jpg",
    ],
    plans: [
      "/images/Изумруд/схемы/1-1.jpg",
      "/images/Изумруд/схемы/1-2.jpg",
      "/images/Изумруд/схемы/1-3.jpg",
      "/images/Изумруд/схемы/1-4.jpg",
      "/images/Изумруд/схемы/1-5.jpg",
      "/images/Изумруд/схемы/1-6.jpg",
    ],
    specs: {
      bedrooms: "2-3",
      bathrooms: "2",
      parking: "1-2",
      year: "2024",
    },
  },
];
